       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       PROCEDURE DIVISION.
       display "Hello, world! cobol".
       stop run.
       